tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf25j10_tdd.h
#define NOT_PD                        522
#define PD                            523
#define NOT_TO                        524
#define nTO                           525
#define TO                            526
#define nRI                           527
#define NOT_RI                        528
#define RI                            529
#define IPEN                          530
#define WDTCON                        531
#define SWDTE                         532
#define SWDTEN                        533
#define OSCCON                        534
#define SCS0                          535
#define SCS                           536
#define SCS1                          537
#define OSTS                          538
#define IDLEN                         539
#define T0CON                         540
#define T0PS                          541
#define T0PS0                         542
#define T0PS1                         543
#define T0PS2                         544
#define PSA                           545
#define T0SE                          546
#define T0CS                          547
#define T08BIT                        548
#define TMR0ON                        549
#define STATUS                        550
#define C                             551
#define CARRY                         552
#define DC                            553
#define ZERO                          554
#define Z                             555
#define OV                            556
#define OVERFLOW                      557
#define N                             558
#define NEGATIVE                      559
#define INTCON3                       560
#define INT1IF                        561
#define INT1F                         562
#define INT2IF                        563
#define INT2F                         564
#define INT1E                         565
#define INT1IE                        566
#define INT2IE                        567
#define INT2E                         568
#define INT1P                         569
#define INT1IP                        570
#define INT2IP                        571
#define INT2P                         572
#define INTCON2                       573
#define RBIP                          574
#define TMR0IP                        575
#define T0IP                          576
#define INTEDG2                       577
#define INTEDG1                       578
#define INTEDG0                       579
#define RBPU                          580
#define NOT_RBPU                      581
#define nRBPU                         582
#define INTCON                        583
#define RBIF                          584
#define INT0F                         585
#define INT0IF                        586
#define T0IF                          587
#define TMR0IF                        588
#define RBIE                          589
#define INT0E                         590
#define INT0IE                        591
#define T0IE                          592
#define TMR0IE                        593
#define PEIE                          594
#define PEIE_GIEL                     595
#define GIEL                          596
#define GIE_GIEH                      597
#define GIE                           598
#define GIEH                          599
#define STKPTR0                       600
#define STKPTR                        601
#define STKPTR1                       602
#define STKPTR2                       603
#define STKPTR3                       604
#define STKPTR4                       605
#define STKUNF                        606
#define STKOVF                        607
#define STKFUL                        608

#endif // _PIC18LF25J10_H_
